#Train PHOCNet
layer {
  name: "TripletInput"
  type: "Python"
  top: "p1"
  top: "p2"
  top: "n"
  python_param {
    module: "triplet"
    layer: "TripletLayer"
    param_str: "{ \"source\": \"/data/fwolf/ordered_iam_50000/iam-db_nti500000_pul2-3-4-5_train_word_images_lmdb\"}"
  }
}
layer {
  name: "conv1_p1"
  type: "Convolution"
  bottom: "p1"
  top: "conv1_p1"
  param {
    name: "conv1_w"
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
  }
}
layer {
  name: "conv1/bn_p1"
  type: "BatchNorm"
  bottom: "conv1_p1"
  top: "conv1/bn_p1"
  param {
    name: "conv1/bn_w1"
  }
  param {
    name: "conv1/bn_w2"
  }
  param {
    name: "conv1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv1/scale_p1"
  type: "Scale"
  bottom: "conv1/bn_p1"
  top: "conv1/bn_p1"
  param {
    name: "conv1/scale_w"
  }
  param {
    name: "conv1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu1_p1"
  type: "ReLU"
  bottom: "conv1/bn_p1"
  top: "conv1/bn_p1"
}
layer {
  name: "pool1_p1"
  type: "Pooling"
  bottom: "conv1/bn_p1"
  top: "pool1_p1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "conv2_1/x1/bn_p1"
  type: "BatchNorm"
  bottom: "pool1_p1"
  top: "conv2_1/x1/bn_p1"
  param {
    name: "conv2_1/x1/bn_w1"
  }
  param {
    name: "conv2_1/x1/bn_w2"
  }
  param {
    name: "conv2_1/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_1/x1/scale_p1"
  type: "Scale"
  bottom: "conv2_1/x1/bn_p1"
  top: "conv2_1/x1/bn_p1"
  param {
    name: "conv2_1/x1/scale_w"
  }
  param {
    name: "conv2_1/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_1/x1_p1"
  type: "ReLU"
  bottom: "conv2_1/x1/bn_p1"
  top: "conv2_1/x1/bn_p1"
}
layer {
  name: "conv2_1/x1_p1"
  type: "Convolution"
  bottom: "conv2_1/x1/bn_p1"
  top: "conv2_1/x1_p1"
  param {
    name: "conv2_1/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv2_1/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv2_1/x1_p1"
  top: "conv2_1/x2/bn_p1"
  param {
    name: "conv2_1/x2/bn_w1"
  }
  param {
    name: "conv2_1/x2/bn_w2"
  }
  param {
    name: "conv2_1/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_1/x2/scale_p1"
  type: "Scale"
  bottom: "conv2_1/x2/bn_p1"
  top: "conv2_1/x2/bn_p1"
  param {
    name: "conv2_1/x2/scale_w"
  }
  param {
    name: "conv2_1/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_1/x2_p1"
  type: "ReLU"
  bottom: "conv2_1/x2/bn_p1"
  top: "conv2_1/x2/bn_p1"
}
layer {
  name: "conv2_1/x2_p1"
  type: "Convolution"
  bottom: "conv2_1/x2/bn_p1"
  top: "conv2_1/x2_p1"
  param {
    name: "conv2_1/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_2_1_p1"
  type: "Concat"
  bottom: "pool1_p1"
  bottom: "conv2_1/x2_p1"
  top: "concat_2_1_p1"
}
layer {
  name: "conv2_2/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_2_1_p1"
  top: "conv2_2/x1/bn_p1"
  param {
    name: "conv2_2/x1/bn_w1"
  }
  param {
    name: "conv2_2/x1/bn_w2"
  }
  param {
    name: "conv2_2/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_2/x1/scale_p1"
  type: "Scale"
  bottom: "conv2_2/x1/bn_p1"
  top: "conv2_2/x1/bn_p1"
  param {
    name: "conv2_2/x1/scale_w"
  }
  param {
    name: "conv2_2/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_2/x1_p1"
  type: "ReLU"
  bottom: "conv2_2/x1/bn_p1"
  top: "conv2_2/x1/bn_p1"
}
layer {
  name: "conv2_2/x1_p1"
  type: "Convolution"
  bottom: "conv2_2/x1/bn_p1"
  top: "conv2_2/x1_p1"
  param {
    name: "conv2_2/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv2_2/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv2_2/x1_p1"
  top: "conv2_2/x2/bn_p1"
  param {
    name: "conv2_2/x2/bn_w1"
  }
  param {
    name: "conv2_2/x2/bn_w2"
  }
  param {
    name: "conv2_2/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_2/x2/scale_p1"
  type: "Scale"
  bottom: "conv2_2/x2/bn_p1"
  top: "conv2_2/x2/bn_p1"
  param {
    name: "conv2_2/x2/scale_w"
  }
  param {
    name: "conv2_2/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_2/x2_p1"
  type: "ReLU"
  bottom: "conv2_2/x2/bn_p1"
  top: "conv2_2/x2/bn_p1"
}
layer {
  name: "conv2_2/x2_p1"
  type: "Convolution"
  bottom: "conv2_2/x2/bn_p1"
  top: "conv2_2/x2_p1"
  param {
    name: "conv2_2/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_2_2_p1"
  type: "Concat"
  bottom: "concat_2_1_p1"
  bottom: "conv2_2/x2_p1"
  top: "concat_2_2_p1"
}
layer {
  name: "conv2_3/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_2_2_p1"
  top: "conv2_3/x1/bn_p1"
  param {
    name: "conv2_3/x1/bn_w1"
  }
  param {
    name: "conv2_3/x1/bn_w2"
  }
  param {
    name: "conv2_3/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_3/x1/scale_p1"
  type: "Scale"
  bottom: "conv2_3/x1/bn_p1"
  top: "conv2_3/x1/bn_p1"
  param {
    name: "conv2_3/x1/scale_w"
  }
  param {
    name: "conv2_3/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_3/x1_p1"
  type: "ReLU"
  bottom: "conv2_3/x1/bn_p1"
  top: "conv2_3/x1/bn_p1"
}
layer {
  name: "conv2_3/x1_p1"
  type: "Convolution"
  bottom: "conv2_3/x1/bn_p1"
  top: "conv2_3/x1_p1"
  param {
    name: "conv2_3/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv2_3/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv2_3/x1_p1"
  top: "conv2_3/x2/bn_p1"
  param {
    name: "conv2_3/x2/bn_w1"
  }
  param {
    name: "conv2_3/x2/bn_w2"
  }
  param {
    name: "conv2_3/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_3/x2/scale_p1"
  type: "Scale"
  bottom: "conv2_3/x2/bn_p1"
  top: "conv2_3/x2/bn_p1"
  param {
    name: "conv2_3/x2/scale_w"
  }
  param {
    name: "conv2_3/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_3/x2_p1"
  type: "ReLU"
  bottom: "conv2_3/x2/bn_p1"
  top: "conv2_3/x2/bn_p1"
}
layer {
  name: "conv2_3/x2_p1"
  type: "Convolution"
  bottom: "conv2_3/x2/bn_p1"
  top: "conv2_3/x2_p1"
  param {
    name: "conv2_3/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_2_3_p1"
  type: "Concat"
  bottom: "concat_2_2_p1"
  bottom: "conv2_3/x2_p1"
  top: "concat_2_3_p1"
}
layer {
  name: "conv2_4/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_2_3_p1"
  top: "conv2_4/x1/bn_p1"
  param {
    name: "conv2_4/x1/bn_w1"
  }
  param {
    name: "conv2_4/x1/bn_w2"
  }
  param {
    name: "conv2_4/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_4/x1/scale_p1"
  type: "Scale"
  bottom: "conv2_4/x1/bn_p1"
  top: "conv2_4/x1/bn_p1"
  param {
    name: "conv2_4/x1/scale_w"
  }
  param {
    name: "conv2_4/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_4/x1_p1"
  type: "ReLU"
  bottom: "conv2_4/x1/bn_p1"
  top: "conv2_4/x1/bn_p1"
}
layer {
  name: "conv2_4/x1_p1"
  type: "Convolution"
  bottom: "conv2_4/x1/bn_p1"
  top: "conv2_4/x1_p1"
  param {
    name: "conv2_4/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv2_4/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv2_4/x1_p1"
  top: "conv2_4/x2/bn_p1"
  param {
    name: "conv2_4/x2/bn_w1"
  }
  param {
    name: "conv2_4/x2/bn_w2"
  }
  param {
    name: "conv2_4/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_4/x2/scale_p1"
  type: "Scale"
  bottom: "conv2_4/x2/bn_p1"
  top: "conv2_4/x2/bn_p1"
  param {
    name: "conv2_4/x2/scale_w"
  }
  param {
    name: "conv2_4/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_4/x2_p1"
  type: "ReLU"
  bottom: "conv2_4/x2/bn_p1"
  top: "conv2_4/x2/bn_p1"
}
layer {
  name: "conv2_4/x2_p1"
  type: "Convolution"
  bottom: "conv2_4/x2/bn_p1"
  top: "conv2_4/x2_p1"
  param {
    name: "conv2_4/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_2_4_p1"
  type: "Concat"
  bottom: "concat_2_3_p1"
  bottom: "conv2_4/x2_p1"
  top: "concat_2_4_p1"
}
layer {
  name: "conv2_5/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_2_4_p1"
  top: "conv2_5/x1/bn_p1"
  param {
    name: "conv2_5/x1/bn_w1"
  }
  param {
    name: "conv2_5/x1/bn_w2"
  }
  param {
    name: "conv2_5/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_5/x1/scale_p1"
  type: "Scale"
  bottom: "conv2_5/x1/bn_p1"
  top: "conv2_5/x1/bn_p1"
  param {
    name: "conv2_5/x1/scale_w"
  }
  param {
    name: "conv2_5/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_5/x1_p1"
  type: "ReLU"
  bottom: "conv2_5/x1/bn_p1"
  top: "conv2_5/x1/bn_p1"
}
layer {
  name: "conv2_5/x1_p1"
  type: "Convolution"
  bottom: "conv2_5/x1/bn_p1"
  top: "conv2_5/x1_p1"
  param {
    name: "conv2_5/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv2_5/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv2_5/x1_p1"
  top: "conv2_5/x2/bn_p1"
  param {
    name: "conv2_5/x2/bn_w1"
  }
  param {
    name: "conv2_5/x2/bn_w2"
  }
  param {
    name: "conv2_5/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_5/x2/scale_p1"
  type: "Scale"
  bottom: "conv2_5/x2/bn_p1"
  top: "conv2_5/x2/bn_p1"
  param {
    name: "conv2_5/x2/scale_w"
  }
  param {
    name: "conv2_5/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_5/x2_p1"
  type: "ReLU"
  bottom: "conv2_5/x2/bn_p1"
  top: "conv2_5/x2/bn_p1"
}
layer {
  name: "conv2_5/x2_p1"
  type: "Convolution"
  bottom: "conv2_5/x2/bn_p1"
  top: "conv2_5/x2_p1"
  param {
    name: "conv2_5/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_2_5_p1"
  type: "Concat"
  bottom: "concat_2_4_p1"
  bottom: "conv2_5/x2_p1"
  top: "concat_2_5_p1"
}
layer {
  name: "conv2_6/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_2_5_p1"
  top: "conv2_6/x1/bn_p1"
  param {
    name: "conv2_6/x1/bn_w1"
  }
  param {
    name: "conv2_6/x1/bn_w2"
  }
  param {
    name: "conv2_6/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_6/x1/scale_p1"
  type: "Scale"
  bottom: "conv2_6/x1/bn_p1"
  top: "conv2_6/x1/bn_p1"
  param {
    name: "conv2_6/x1/scale_w"
  }
  param {
    name: "conv2_6/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_6/x1_p1"
  type: "ReLU"
  bottom: "conv2_6/x1/bn_p1"
  top: "conv2_6/x1/bn_p1"
}
layer {
  name: "conv2_6/x1_p1"
  type: "Convolution"
  bottom: "conv2_6/x1/bn_p1"
  top: "conv2_6/x1_p1"
  param {
    name: "conv2_6/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv2_6/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv2_6/x1_p1"
  top: "conv2_6/x2/bn_p1"
  param {
    name: "conv2_6/x2/bn_w1"
  }
  param {
    name: "conv2_6/x2/bn_w2"
  }
  param {
    name: "conv2_6/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_6/x2/scale_p1"
  type: "Scale"
  bottom: "conv2_6/x2/bn_p1"
  top: "conv2_6/x2/bn_p1"
  param {
    name: "conv2_6/x2/scale_w"
  }
  param {
    name: "conv2_6/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_6/x2_p1"
  type: "ReLU"
  bottom: "conv2_6/x2/bn_p1"
  top: "conv2_6/x2/bn_p1"
}
layer {
  name: "conv2_6/x2_p1"
  type: "Convolution"
  bottom: "conv2_6/x2/bn_p1"
  top: "conv2_6/x2_p1"
  param {
    name: "conv2_6/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_2_6_p1"
  type: "Concat"
  bottom: "concat_2_5_p1"
  bottom: "conv2_6/x2_p1"
  top: "concat_2_6_p1"
}
layer {
  name: "conv2_blk/bn_p1"
  type: "BatchNorm"
  bottom: "concat_2_6_p1"
  top: "conv2_blk/bn_p1"
  param {
    name: "conv2_blk/bn_w1"
  }
  param {
    name: "conv2_blk/bn_w2"
  }
  param {
    name: "conv2_blk/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv2_blk/scale_p1"
  type: "Scale"
  bottom: "conv2_blk/bn_p1"
  top: "conv2_blk/bn_p1"
  param {
    name: "conv2_blk/scale_w"
  }
  param {
    name: "conv2_blk/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_blk_p1"
  type: "ReLU"
  bottom: "conv2_blk/bn_p1"
  top: "conv2_blk/bn_p1"
}
layer {
  name: "conv2_blk_p1"
  type: "Convolution"
  bottom: "conv2_blk/bn_p1"
  top: "conv2_blk_p1"
  param {
    name: "conv2_blk_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "pool2_p1"
  type: "Pooling"
  bottom: "conv2_blk_p1"
  top: "pool2_p1"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1/x1/bn_p1"
  type: "BatchNorm"
  bottom: "pool2_p1"
  top: "conv3_1/x1/bn_p1"
  param {
    name: "conv3_1/x1/bn_w1"
  }
  param {
    name: "conv3_1/x1/bn_w2"
  }
  param {
    name: "conv3_1/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_1/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_1/x1/bn_p1"
  top: "conv3_1/x1/bn_p1"
  param {
    name: "conv3_1/x1/scale_w"
  }
  param {
    name: "conv3_1/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_1/x1_p1"
  type: "ReLU"
  bottom: "conv3_1/x1/bn_p1"
  top: "conv3_1/x1/bn_p1"
}
layer {
  name: "conv3_1/x1_p1"
  type: "Convolution"
  bottom: "conv3_1/x1/bn_p1"
  top: "conv3_1/x1_p1"
  param {
    name: "conv3_1/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_1/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_1/x1_p1"
  top: "conv3_1/x2/bn_p1"
  param {
    name: "conv3_1/x2/bn_w1"
  }
  param {
    name: "conv3_1/x2/bn_w2"
  }
  param {
    name: "conv3_1/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_1/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_1/x2/bn_p1"
  top: "conv3_1/x2/bn_p1"
  param {
    name: "conv3_1/x2/scale_w"
  }
  param {
    name: "conv3_1/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_1/x2_p1"
  type: "ReLU"
  bottom: "conv3_1/x2/bn_p1"
  top: "conv3_1/x2/bn_p1"
}
layer {
  name: "conv3_1/x2_p1"
  type: "Convolution"
  bottom: "conv3_1/x2/bn_p1"
  top: "conv3_1/x2_p1"
  param {
    name: "conv3_1/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_1_p1"
  type: "Concat"
  bottom: "pool2_p1"
  bottom: "conv3_1/x2_p1"
  top: "concat_3_1_p1"
}
layer {
  name: "conv3_2/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_1_p1"
  top: "conv3_2/x1/bn_p1"
  param {
    name: "conv3_2/x1/bn_w1"
  }
  param {
    name: "conv3_2/x1/bn_w2"
  }
  param {
    name: "conv3_2/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_2/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_2/x1/bn_p1"
  top: "conv3_2/x1/bn_p1"
  param {
    name: "conv3_2/x1/scale_w"
  }
  param {
    name: "conv3_2/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_2/x1_p1"
  type: "ReLU"
  bottom: "conv3_2/x1/bn_p1"
  top: "conv3_2/x1/bn_p1"
}
layer {
  name: "conv3_2/x1_p1"
  type: "Convolution"
  bottom: "conv3_2/x1/bn_p1"
  top: "conv3_2/x1_p1"
  param {
    name: "conv3_2/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_2/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_2/x1_p1"
  top: "conv3_2/x2/bn_p1"
  param {
    name: "conv3_2/x2/bn_w1"
  }
  param {
    name: "conv3_2/x2/bn_w2"
  }
  param {
    name: "conv3_2/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_2/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_2/x2/bn_p1"
  top: "conv3_2/x2/bn_p1"
  param {
    name: "conv3_2/x2/scale_w"
  }
  param {
    name: "conv3_2/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_2/x2_p1"
  type: "ReLU"
  bottom: "conv3_2/x2/bn_p1"
  top: "conv3_2/x2/bn_p1"
}
layer {
  name: "conv3_2/x2_p1"
  type: "Convolution"
  bottom: "conv3_2/x2/bn_p1"
  top: "conv3_2/x2_p1"
  param {
    name: "conv3_2/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_2_p1"
  type: "Concat"
  bottom: "concat_3_1_p1"
  bottom: "conv3_2/x2_p1"
  top: "concat_3_2_p1"
}
layer {
  name: "conv3_3/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_2_p1"
  top: "conv3_3/x1/bn_p1"
  param {
    name: "conv3_3/x1/bn_w1"
  }
  param {
    name: "conv3_3/x1/bn_w2"
  }
  param {
    name: "conv3_3/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_3/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_3/x1/bn_p1"
  top: "conv3_3/x1/bn_p1"
  param {
    name: "conv3_3/x1/scale_w"
  }
  param {
    name: "conv3_3/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_3/x1_p1"
  type: "ReLU"
  bottom: "conv3_3/x1/bn_p1"
  top: "conv3_3/x1/bn_p1"
}
layer {
  name: "conv3_3/x1_p1"
  type: "Convolution"
  bottom: "conv3_3/x1/bn_p1"
  top: "conv3_3/x1_p1"
  param {
    name: "conv3_3/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_3/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_3/x1_p1"
  top: "conv3_3/x2/bn_p1"
  param {
    name: "conv3_3/x2/bn_w1"
  }
  param {
    name: "conv3_3/x2/bn_w2"
  }
  param {
    name: "conv3_3/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_3/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_3/x2/bn_p1"
  top: "conv3_3/x2/bn_p1"
  param {
    name: "conv3_3/x2/scale_w"
  }
  param {
    name: "conv3_3/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_3/x2_p1"
  type: "ReLU"
  bottom: "conv3_3/x2/bn_p1"
  top: "conv3_3/x2/bn_p1"
}
layer {
  name: "conv3_3/x2_p1"
  type: "Convolution"
  bottom: "conv3_3/x2/bn_p1"
  top: "conv3_3/x2_p1"
  param {
    name: "conv3_3/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_3_p1"
  type: "Concat"
  bottom: "concat_3_2_p1"
  bottom: "conv3_3/x2_p1"
  top: "concat_3_3_p1"
}
layer {
  name: "conv3_4/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_3_p1"
  top: "conv3_4/x1/bn_p1"
  param {
    name: "conv3_4/x1/bn_w1"
  }
  param {
    name: "conv3_4/x1/bn_w2"
  }
  param {
    name: "conv3_4/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_4/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_4/x1/bn_p1"
  top: "conv3_4/x1/bn_p1"
  param {
    name: "conv3_4/x1/scale_w"
  }
  param {
    name: "conv3_4/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_4/x1_p1"
  type: "ReLU"
  bottom: "conv3_4/x1/bn_p1"
  top: "conv3_4/x1/bn_p1"
}
layer {
  name: "conv3_4/x1_p1"
  type: "Convolution"
  bottom: "conv3_4/x1/bn_p1"
  top: "conv3_4/x1_p1"
  param {
    name: "conv3_4/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_4/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_4/x1_p1"
  top: "conv3_4/x2/bn_p1"
  param {
    name: "conv3_4/x2/bn_w1"
  }
  param {
    name: "conv3_4/x2/bn_w2"
  }
  param {
    name: "conv3_4/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_4/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_4/x2/bn_p1"
  top: "conv3_4/x2/bn_p1"
  param {
    name: "conv3_4/x2/scale_w"
  }
  param {
    name: "conv3_4/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_4/x2_p1"
  type: "ReLU"
  bottom: "conv3_4/x2/bn_p1"
  top: "conv3_4/x2/bn_p1"
}
layer {
  name: "conv3_4/x2_p1"
  type: "Convolution"
  bottom: "conv3_4/x2/bn_p1"
  top: "conv3_4/x2_p1"
  param {
    name: "conv3_4/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_4_p1"
  type: "Concat"
  bottom: "concat_3_3_p1"
  bottom: "conv3_4/x2_p1"
  top: "concat_3_4_p1"
}
layer {
  name: "conv3_5/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_4_p1"
  top: "conv3_5/x1/bn_p1"
  param {
    name: "conv3_5/x1/bn_w1"
  }
  param {
    name: "conv3_5/x1/bn_w2"
  }
  param {
    name: "conv3_5/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_5/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_5/x1/bn_p1"
  top: "conv3_5/x1/bn_p1"
  param {
    name: "conv3_5/x1/scale_w"
  }
  param {
    name: "conv3_5/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_5/x1_p1"
  type: "ReLU"
  bottom: "conv3_5/x1/bn_p1"
  top: "conv3_5/x1/bn_p1"
}
layer {
  name: "conv3_5/x1_p1"
  type: "Convolution"
  bottom: "conv3_5/x1/bn_p1"
  top: "conv3_5/x1_p1"
  param {
    name: "conv3_5/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_5/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_5/x1_p1"
  top: "conv3_5/x2/bn_p1"
  param {
    name: "conv3_5/x2/bn_w1"
  }
  param {
    name: "conv3_5/x2/bn_w2"
  }
  param {
    name: "conv3_5/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_5/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_5/x2/bn_p1"
  top: "conv3_5/x2/bn_p1"
  param {
    name: "conv3_5/x2/scale_w"
  }
  param {
    name: "conv3_5/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_5/x2_p1"
  type: "ReLU"
  bottom: "conv3_5/x2/bn_p1"
  top: "conv3_5/x2/bn_p1"
}
layer {
  name: "conv3_5/x2_p1"
  type: "Convolution"
  bottom: "conv3_5/x2/bn_p1"
  top: "conv3_5/x2_p1"
  param {
    name: "conv3_5/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_5_p1"
  type: "Concat"
  bottom: "concat_3_4_p1"
  bottom: "conv3_5/x2_p1"
  top: "concat_3_5_p1"
}
layer {
  name: "conv3_6/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_5_p1"
  top: "conv3_6/x1/bn_p1"
  param {
    name: "conv3_6/x1/bn_w1"
  }
  param {
    name: "conv3_6/x1/bn_w2"
  }
  param {
    name: "conv3_6/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_6/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_6/x1/bn_p1"
  top: "conv3_6/x1/bn_p1"
  param {
    name: "conv3_6/x1/scale_w"
  }
  param {
    name: "conv3_6/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_6/x1_p1"
  type: "ReLU"
  bottom: "conv3_6/x1/bn_p1"
  top: "conv3_6/x1/bn_p1"
}
layer {
  name: "conv3_6/x1_p1"
  type: "Convolution"
  bottom: "conv3_6/x1/bn_p1"
  top: "conv3_6/x1_p1"
  param {
    name: "conv3_6/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_6/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_6/x1_p1"
  top: "conv3_6/x2/bn_p1"
  param {
    name: "conv3_6/x2/bn_w1"
  }
  param {
    name: "conv3_6/x2/bn_w2"
  }
  param {
    name: "conv3_6/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_6/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_6/x2/bn_p1"
  top: "conv3_6/x2/bn_p1"
  param {
    name: "conv3_6/x2/scale_w"
  }
  param {
    name: "conv3_6/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_6/x2_p1"
  type: "ReLU"
  bottom: "conv3_6/x2/bn_p1"
  top: "conv3_6/x2/bn_p1"
}
layer {
  name: "conv3_6/x2_p1"
  type: "Convolution"
  bottom: "conv3_6/x2/bn_p1"
  top: "conv3_6/x2_p1"
  param {
    name: "conv3_6/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_6_p1"
  type: "Concat"
  bottom: "concat_3_5_p1"
  bottom: "conv3_6/x2_p1"
  top: "concat_3_6_p1"
}
layer {
  name: "conv3_7/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_6_p1"
  top: "conv3_7/x1/bn_p1"
  param {
    name: "conv3_7/x1/bn_w1"
  }
  param {
    name: "conv3_7/x1/bn_w2"
  }
  param {
    name: "conv3_7/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_7/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_7/x1/bn_p1"
  top: "conv3_7/x1/bn_p1"
  param {
    name: "conv3_7/x1/scale_w"
  }
  param {
    name: "conv3_7/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_7/x1_p1"
  type: "ReLU"
  bottom: "conv3_7/x1/bn_p1"
  top: "conv3_7/x1/bn_p1"
}
layer {
  name: "conv3_7/x1_p1"
  type: "Convolution"
  bottom: "conv3_7/x1/bn_p1"
  top: "conv3_7/x1_p1"
  param {
    name: "conv3_7/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_7/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_7/x1_p1"
  top: "conv3_7/x2/bn_p1"
  param {
    name: "conv3_7/x2/bn_w1"
  }
  param {
    name: "conv3_7/x2/bn_w2"
  }
  param {
    name: "conv3_7/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_7/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_7/x2/bn_p1"
  top: "conv3_7/x2/bn_p1"
  param {
    name: "conv3_7/x2/scale_w"
  }
  param {
    name: "conv3_7/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_7/x2_p1"
  type: "ReLU"
  bottom: "conv3_7/x2/bn_p1"
  top: "conv3_7/x2/bn_p1"
}
layer {
  name: "conv3_7/x2_p1"
  type: "Convolution"
  bottom: "conv3_7/x2/bn_p1"
  top: "conv3_7/x2_p1"
  param {
    name: "conv3_7/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_7_p1"
  type: "Concat"
  bottom: "concat_3_6_p1"
  bottom: "conv3_7/x2_p1"
  top: "concat_3_7_p1"
}
layer {
  name: "conv3_8/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_7_p1"
  top: "conv3_8/x1/bn_p1"
  param {
    name: "conv3_8/x1/bn_w1"
  }
  param {
    name: "conv3_8/x1/bn_w2"
  }
  param {
    name: "conv3_8/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_8/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_8/x1/bn_p1"
  top: "conv3_8/x1/bn_p1"
  param {
    name: "conv3_8/x1/scale_w"
  }
  param {
    name: "conv3_8/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_8/x1_p1"
  type: "ReLU"
  bottom: "conv3_8/x1/bn_p1"
  top: "conv3_8/x1/bn_p1"
}
layer {
  name: "conv3_8/x1_p1"
  type: "Convolution"
  bottom: "conv3_8/x1/bn_p1"
  top: "conv3_8/x1_p1"
  param {
    name: "conv3_8/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_8/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_8/x1_p1"
  top: "conv3_8/x2/bn_p1"
  param {
    name: "conv3_8/x2/bn_w1"
  }
  param {
    name: "conv3_8/x2/bn_w2"
  }
  param {
    name: "conv3_8/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_8/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_8/x2/bn_p1"
  top: "conv3_8/x2/bn_p1"
  param {
    name: "conv3_8/x2/scale_w"
  }
  param {
    name: "conv3_8/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_8/x2_p1"
  type: "ReLU"
  bottom: "conv3_8/x2/bn_p1"
  top: "conv3_8/x2/bn_p1"
}
layer {
  name: "conv3_8/x2_p1"
  type: "Convolution"
  bottom: "conv3_8/x2/bn_p1"
  top: "conv3_8/x2_p1"
  param {
    name: "conv3_8/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_8_p1"
  type: "Concat"
  bottom: "concat_3_7_p1"
  bottom: "conv3_8/x2_p1"
  top: "concat_3_8_p1"
}
layer {
  name: "conv3_9/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_8_p1"
  top: "conv3_9/x1/bn_p1"
  param {
    name: "conv3_9/x1/bn_w1"
  }
  param {
    name: "conv3_9/x1/bn_w2"
  }
  param {
    name: "conv3_9/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_9/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_9/x1/bn_p1"
  top: "conv3_9/x1/bn_p1"
  param {
    name: "conv3_9/x1/scale_w"
  }
  param {
    name: "conv3_9/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_9/x1_p1"
  type: "ReLU"
  bottom: "conv3_9/x1/bn_p1"
  top: "conv3_9/x1/bn_p1"
}
layer {
  name: "conv3_9/x1_p1"
  type: "Convolution"
  bottom: "conv3_9/x1/bn_p1"
  top: "conv3_9/x1_p1"
  param {
    name: "conv3_9/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_9/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_9/x1_p1"
  top: "conv3_9/x2/bn_p1"
  param {
    name: "conv3_9/x2/bn_w1"
  }
  param {
    name: "conv3_9/x2/bn_w2"
  }
  param {
    name: "conv3_9/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_9/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_9/x2/bn_p1"
  top: "conv3_9/x2/bn_p1"
  param {
    name: "conv3_9/x2/scale_w"
  }
  param {
    name: "conv3_9/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_9/x2_p1"
  type: "ReLU"
  bottom: "conv3_9/x2/bn_p1"
  top: "conv3_9/x2/bn_p1"
}
layer {
  name: "conv3_9/x2_p1"
  type: "Convolution"
  bottom: "conv3_9/x2/bn_p1"
  top: "conv3_9/x2_p1"
  param {
    name: "conv3_9/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_9_p1"
  type: "Concat"
  bottom: "concat_3_8_p1"
  bottom: "conv3_9/x2_p1"
  top: "concat_3_9_p1"
}
layer {
  name: "conv3_10/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_9_p1"
  top: "conv3_10/x1/bn_p1"
  param {
    name: "conv3_10/x1/bn_w1"
  }
  param {
    name: "conv3_10/x1/bn_w2"
  }
  param {
    name: "conv3_10/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_10/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_10/x1/bn_p1"
  top: "conv3_10/x1/bn_p1"
  param {
    name: "conv3_10/x1/scale_w"
  }
  param {
    name: "conv3_10/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_10/x1_p1"
  type: "ReLU"
  bottom: "conv3_10/x1/bn_p1"
  top: "conv3_10/x1/bn_p1"
}
layer {
  name: "conv3_10/x1_p1"
  type: "Convolution"
  bottom: "conv3_10/x1/bn_p1"
  top: "conv3_10/x1_p1"
  param {
    name: "conv3_10/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_10/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_10/x1_p1"
  top: "conv3_10/x2/bn_p1"
  param {
    name: "conv3_10/x2/bn_w1"
  }
  param {
    name: "conv3_10/x2/bn_w2"
  }
  param {
    name: "conv3_10/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_10/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_10/x2/bn_p1"
  top: "conv3_10/x2/bn_p1"
  param {
    name: "conv3_10/x2/scale_w"
  }
  param {
    name: "conv3_10/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_10/x2_p1"
  type: "ReLU"
  bottom: "conv3_10/x2/bn_p1"
  top: "conv3_10/x2/bn_p1"
}
layer {
  name: "conv3_10/x2_p1"
  type: "Convolution"
  bottom: "conv3_10/x2/bn_p1"
  top: "conv3_10/x2_p1"
  param {
    name: "conv3_10/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_10_p1"
  type: "Concat"
  bottom: "concat_3_9_p1"
  bottom: "conv3_10/x2_p1"
  top: "concat_3_10_p1"
}
layer {
  name: "conv3_11/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_10_p1"
  top: "conv3_11/x1/bn_p1"
  param {
    name: "conv3_11/x1/bn_w1"
  }
  param {
    name: "conv3_11/x1/bn_w2"
  }
  param {
    name: "conv3_11/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_11/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_11/x1/bn_p1"
  top: "conv3_11/x1/bn_p1"
  param {
    name: "conv3_11/x1/scale_w"
  }
  param {
    name: "conv3_11/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_11/x1_p1"
  type: "ReLU"
  bottom: "conv3_11/x1/bn_p1"
  top: "conv3_11/x1/bn_p1"
}
layer {
  name: "conv3_11/x1_p1"
  type: "Convolution"
  bottom: "conv3_11/x1/bn_p1"
  top: "conv3_11/x1_p1"
  param {
    name: "conv3_11/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_11/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_11/x1_p1"
  top: "conv3_11/x2/bn_p1"
  param {
    name: "conv3_11/x2/bn_w1"
  }
  param {
    name: "conv3_11/x2/bn_w2"
  }
  param {
    name: "conv3_11/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_11/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_11/x2/bn_p1"
  top: "conv3_11/x2/bn_p1"
  param {
    name: "conv3_11/x2/scale_w"
  }
  param {
    name: "conv3_11/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_11/x2_p1"
  type: "ReLU"
  bottom: "conv3_11/x2/bn_p1"
  top: "conv3_11/x2/bn_p1"
}
layer {
  name: "conv3_11/x2_p1"
  type: "Convolution"
  bottom: "conv3_11/x2/bn_p1"
  top: "conv3_11/x2_p1"
  param {
    name: "conv3_11/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_11_p1"
  type: "Concat"
  bottom: "concat_3_10_p1"
  bottom: "conv3_11/x2_p1"
  top: "concat_3_11_p1"
}
layer {
  name: "conv3_12/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_11_p1"
  top: "conv3_12/x1/bn_p1"
  param {
    name: "conv3_12/x1/bn_w1"
  }
  param {
    name: "conv3_12/x1/bn_w2"
  }
  param {
    name: "conv3_12/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_12/x1/scale_p1"
  type: "Scale"
  bottom: "conv3_12/x1/bn_p1"
  top: "conv3_12/x1/bn_p1"
  param {
    name: "conv3_12/x1/scale_w"
  }
  param {
    name: "conv3_12/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_12/x1_p1"
  type: "ReLU"
  bottom: "conv3_12/x1/bn_p1"
  top: "conv3_12/x1/bn_p1"
}
layer {
  name: "conv3_12/x1_p1"
  type: "Convolution"
  bottom: "conv3_12/x1/bn_p1"
  top: "conv3_12/x1_p1"
  param {
    name: "conv3_12/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv3_12/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv3_12/x1_p1"
  top: "conv3_12/x2/bn_p1"
  param {
    name: "conv3_12/x2/bn_w1"
  }
  param {
    name: "conv3_12/x2/bn_w2"
  }
  param {
    name: "conv3_12/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_12/x2/scale_p1"
  type: "Scale"
  bottom: "conv3_12/x2/bn_p1"
  top: "conv3_12/x2/bn_p1"
  param {
    name: "conv3_12/x2/scale_w"
  }
  param {
    name: "conv3_12/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_12/x2_p1"
  type: "ReLU"
  bottom: "conv3_12/x2/bn_p1"
  top: "conv3_12/x2/bn_p1"
}
layer {
  name: "conv3_12/x2_p1"
  type: "Convolution"
  bottom: "conv3_12/x2/bn_p1"
  top: "conv3_12/x2_p1"
  param {
    name: "conv3_12/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_3_12_p1"
  type: "Concat"
  bottom: "concat_3_11_p1"
  bottom: "conv3_12/x2_p1"
  top: "concat_3_12_p1"
}
layer {
  name: "conv3_blk/bn_p1"
  type: "BatchNorm"
  bottom: "concat_3_12_p1"
  top: "conv3_blk/bn_p1"
  param {
    name: "conv3_blk/bn_w1"
  }
  param {
    name: "conv3_blk/bn_w2"
  }
  param {
    name: "conv3_blk/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv3_blk/scale_p1"
  type: "Scale"
  bottom: "conv3_blk/bn_p1"
  top: "conv3_blk/bn_p1"
  param {
    name: "conv3_blk/scale_w"
  }
  param {
    name: "conv3_blk/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_blk_p1"
  type: "ReLU"
  bottom: "conv3_blk/bn_p1"
  top: "conv3_blk/bn_p1"
}
layer {
  name: "conv3_blk_p1"
  type: "Convolution"
  bottom: "conv3_blk/bn_p1"
  top: "conv3_blk_p1"
  param {
    name: "conv3_blk_w"
  }
  convolution_param {
    num_output: 256
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "pool3_p1"
  type: "Pooling"
  bottom: "conv3_blk_p1"
  top: "pool3_p1"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1/x1/bn_p1"
  type: "BatchNorm"
  bottom: "pool3_p1"
  top: "conv4_1/x1/bn_p1"
  param {
    name: "conv4_1/x1/bn_w1"
  }
  param {
    name: "conv4_1/x1/bn_w2"
  }
  param {
    name: "conv4_1/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_1/x1/scale_p1"
  type: "Scale"
  bottom: "conv4_1/x1/bn_p1"
  top: "conv4_1/x1/bn_p1"
  param {
    name: "conv4_1/x1/scale_w"
  }
  param {
    name: "conv4_1/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_1/x1_p1"
  type: "ReLU"
  bottom: "conv4_1/x1/bn_p1"
  top: "conv4_1/x1/bn_p1"
}
layer {
  name: "conv4_1/x1_p1"
  type: "Convolution"
  bottom: "conv4_1/x1/bn_p1"
  top: "conv4_1/x1_p1"
  param {
    name: "conv4_1/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv4_1/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv4_1/x1_p1"
  top: "conv4_1/x2/bn_p1"
  param {
    name: "conv4_1/x2/bn_w1"
  }
  param {
    name: "conv4_1/x2/bn_w2"
  }
  param {
    name: "conv4_1/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_1/x2/scale_p1"
  type: "Scale"
  bottom: "conv4_1/x2/bn_p1"
  top: "conv4_1/x2/bn_p1"
  param {
    name: "conv4_1/x2/scale_w"
  }
  param {
    name: "conv4_1/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_1/x2_p1"
  type: "ReLU"
  bottom: "conv4_1/x2/bn_p1"
  top: "conv4_1/x2/bn_p1"
}
layer {
  name: "conv4_1/x2_p1"
  type: "Convolution"
  bottom: "conv4_1/x2/bn_p1"
  top: "conv4_1/x2_p1"
  param {
    name: "conv4_1/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_4_1_p1"
  type: "Concat"
  bottom: "pool3_p1"
  bottom: "conv4_1/x2_p1"
  top: "concat_4_1_p1"
}
layer {
  name: "conv4_2/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_4_1_p1"
  top: "conv4_2/x1/bn_p1"
  param {
    name: "conv4_2/x1/bn_w1"
  }
  param {
    name: "conv4_2/x1/bn_w2"
  }
  param {
    name: "conv4_2/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_2/x1/scale_p1"
  type: "Scale"
  bottom: "conv4_2/x1/bn_p1"
  top: "conv4_2/x1/bn_p1"
  param {
    name: "conv4_2/x1/scale_w"
  }
  param {
    name: "conv4_2/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_2/x1_p1"
  type: "ReLU"
  bottom: "conv4_2/x1/bn_p1"
  top: "conv4_2/x1/bn_p1"
}
layer {
  name: "conv4_2/x1_p1"
  type: "Convolution"
  bottom: "conv4_2/x1/bn_p1"
  top: "conv4_2/x1_p1"
  param {
    name: "conv4_2/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv4_2/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv4_2/x1_p1"
  top: "conv4_2/x2/bn_p1"
  param {
    name: "conv4_2/x2/bn_w1"
  }
  param {
    name: "conv4_2/x2/bn_w2"
  }
  param {
    name: "conv4_2/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_2/x2/scale_p1"
  type: "Scale"
  bottom: "conv4_2/x2/bn_p1"
  top: "conv4_2/x2/bn_p1"
  param {
    name: "conv4_2/x2/scale_w"
  }
  param {
    name: "conv4_2/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_2/x2_p1"
  type: "ReLU"
  bottom: "conv4_2/x2/bn_p1"
  top: "conv4_2/x2/bn_p1"
}
layer {
  name: "conv4_2/x2_p1"
  type: "Convolution"
  bottom: "conv4_2/x2/bn_p1"
  top: "conv4_2/x2_p1"
  param {
    name: "conv4_2/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_4_2_p1"
  type: "Concat"
  bottom: "concat_4_1_p1"
  bottom: "conv4_2/x2_p1"
  top: "concat_4_2_p1"
}
layer {
  name: "conv4_3/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_4_2_p1"
  top: "conv4_3/x1/bn_p1"
  param {
    name: "conv4_3/x1/bn_w1"
  }
  param {
    name: "conv4_3/x1/bn_w2"
  }
  param {
    name: "conv4_3/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_3/x1/scale_p1"
  type: "Scale"
  bottom: "conv4_3/x1/bn_p1"
  top: "conv4_3/x1/bn_p1"
  param {
    name: "conv4_3/x1/scale_w"
  }
  param {
    name: "conv4_3/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_3/x1_p1"
  type: "ReLU"
  bottom: "conv4_3/x1/bn_p1"
  top: "conv4_3/x1/bn_p1"
}
layer {
  name: "conv4_3/x1_p1"
  type: "Convolution"
  bottom: "conv4_3/x1/bn_p1"
  top: "conv4_3/x1_p1"
  param {
    name: "conv4_3/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv4_3/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv4_3/x1_p1"
  top: "conv4_3/x2/bn_p1"
  param {
    name: "conv4_3/x2/bn_w1"
  }
  param {
    name: "conv4_3/x2/bn_w2"
  }
  param {
    name: "conv4_3/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_3/x2/scale_p1"
  type: "Scale"
  bottom: "conv4_3/x2/bn_p1"
  top: "conv4_3/x2/bn_p1"
  param {
    name: "conv4_3/x2/scale_w"
  }
  param {
    name: "conv4_3/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_3/x2_p1"
  type: "ReLU"
  bottom: "conv4_3/x2/bn_p1"
  top: "conv4_3/x2/bn_p1"
}
layer {
  name: "conv4_3/x2_p1"
  type: "Convolution"
  bottom: "conv4_3/x2/bn_p1"
  top: "conv4_3/x2_p1"
  param {
    name: "conv4_3/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_4_3_p1"
  type: "Concat"
  bottom: "concat_4_2_p1"
  bottom: "conv4_3/x2_p1"
  top: "concat_4_3_p1"
}
layer {
  name: "conv4_4/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_4_3_p1"
  top: "conv4_4/x1/bn_p1"
  param {
    name: "conv4_4/x1/bn_w1"
  }
  param {
    name: "conv4_4/x1/bn_w2"
  }
  param {
    name: "conv4_4/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_4/x1/scale_p1"
  type: "Scale"
  bottom: "conv4_4/x1/bn_p1"
  top: "conv4_4/x1/bn_p1"
  param {
    name: "conv4_4/x1/scale_w"
  }
  param {
    name: "conv4_4/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_4/x1_p1"
  type: "ReLU"
  bottom: "conv4_4/x1/bn_p1"
  top: "conv4_4/x1/bn_p1"
}
layer {
  name: "conv4_4/x1_p1"
  type: "Convolution"
  bottom: "conv4_4/x1/bn_p1"
  top: "conv4_4/x1_p1"
  param {
    name: "conv4_4/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv4_4/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv4_4/x1_p1"
  top: "conv4_4/x2/bn_p1"
  param {
    name: "conv4_4/x2/bn_w1"
  }
  param {
    name: "conv4_4/x2/bn_w2"
  }
  param {
    name: "conv4_4/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_4/x2/scale_p1"
  type: "Scale"
  bottom: "conv4_4/x2/bn_p1"
  top: "conv4_4/x2/bn_p1"
  param {
    name: "conv4_4/x2/scale_w"
  }
  param {
    name: "conv4_4/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_4/x2_p1"
  type: "ReLU"
  bottom: "conv4_4/x2/bn_p1"
  top: "conv4_4/x2/bn_p1"
}
layer {
  name: "conv4_4/x2_p1"
  type: "Convolution"
  bottom: "conv4_4/x2/bn_p1"
  top: "conv4_4/x2_p1"
  param {
    name: "conv4_4/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_4_4_p1"
  type: "Concat"
  bottom: "concat_4_3_p1"
  bottom: "conv4_4/x2_p1"
  top: "concat_4_4_p1"
}
layer {
  name: "conv4_5/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_4_4_p1"
  top: "conv4_5/x1/bn_p1"
  param {
    name: "conv4_5/x1/bn_w1"
  }
  param {
    name: "conv4_5/x1/bn_w2"
  }
  param {
    name: "conv4_5/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_5/x1/scale_p1"
  type: "Scale"
  bottom: "conv4_5/x1/bn_p1"
  top: "conv4_5/x1/bn_p1"
  param {
    name: "conv4_5/x1/scale_w"
  }
  param {
    name: "conv4_5/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_5/x1_p1"
  type: "ReLU"
  bottom: "conv4_5/x1/bn_p1"
  top: "conv4_5/x1/bn_p1"
}
layer {
  name: "conv4_5/x1_p1"
  type: "Convolution"
  bottom: "conv4_5/x1/bn_p1"
  top: "conv4_5/x1_p1"
  param {
    name: "conv4_5/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv4_5/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv4_5/x1_p1"
  top: "conv4_5/x2/bn_p1"
  param {
    name: "conv4_5/x2/bn_w1"
  }
  param {
    name: "conv4_5/x2/bn_w2"
  }
  param {
    name: "conv4_5/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_5/x2/scale_p1"
  type: "Scale"
  bottom: "conv4_5/x2/bn_p1"
  top: "conv4_5/x2/bn_p1"
  param {
    name: "conv4_5/x2/scale_w"
  }
  param {
    name: "conv4_5/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_5/x2_p1"
  type: "ReLU"
  bottom: "conv4_5/x2/bn_p1"
  top: "conv4_5/x2/bn_p1"
}
layer {
  name: "conv4_5/x2_p1"
  type: "Convolution"
  bottom: "conv4_5/x2/bn_p1"
  top: "conv4_5/x2_p1"
  param {
    name: "conv4_5/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_4_5_p1"
  type: "Concat"
  bottom: "concat_4_4_p1"
  bottom: "conv4_5/x2_p1"
  top: "concat_4_5_p1"
}
layer {
  name: "conv4_6/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_4_5_p1"
  top: "conv4_6/x1/bn_p1"
  param {
    name: "conv4_6/x1/bn_w1"
  }
  param {
    name: "conv4_6/x1/bn_w2"
  }
  param {
    name: "conv4_6/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_6/x1/scale_p1"
  type: "Scale"
  bottom: "conv4_6/x1/bn_p1"
  top: "conv4_6/x1/bn_p1"
  param {
    name: "conv4_6/x1/scale_w"
  }
  param {
    name: "conv4_6/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_6/x1_p1"
  type: "ReLU"
  bottom: "conv4_6/x1/bn_p1"
  top: "conv4_6/x1/bn_p1"
}
layer {
  name: "conv4_6/x1_p1"
  type: "Convolution"
  bottom: "conv4_6/x1/bn_p1"
  top: "conv4_6/x1_p1"
  param {
    name: "conv4_6/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv4_6/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv4_6/x1_p1"
  top: "conv4_6/x2/bn_p1"
  param {
    name: "conv4_6/x2/bn_w1"
  }
  param {
    name: "conv4_6/x2/bn_w2"
  }
  param {
    name: "conv4_6/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_6/x2/scale_p1"
  type: "Scale"
  bottom: "conv4_6/x2/bn_p1"
  top: "conv4_6/x2/bn_p1"
  param {
    name: "conv4_6/x2/scale_w"
  }
  param {
    name: "conv4_6/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_6/x2_p1"
  type: "ReLU"
  bottom: "conv4_6/x2/bn_p1"
  top: "conv4_6/x2/bn_p1"
}
layer {
  name: "conv4_6/x2_p1"
  type: "Convolution"
  bottom: "conv4_6/x2/bn_p1"
  top: "conv4_6/x2_p1"
  param {
    name: "conv4_6/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_4_6_p1"
  type: "Concat"
  bottom: "concat_4_5_p1"
  bottom: "conv4_6/x2_p1"
  top: "concat_4_6_p1"
}
layer {
  name: "conv4_7/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_4_6_p1"
  top: "conv4_7/x1/bn_p1"
  param {
    name: "conv4_7/x1/bn_w1"
  }
  param {
    name: "conv4_7/x1/bn_w2"
  }
  param {
    name: "conv4_7/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_7/x1/scale_p1"
  type: "Scale"
  bottom: "conv4_7/x1/bn_p1"
  top: "conv4_7/x1/bn_p1"
  param {
    name: "conv4_7/x1/scale_w"
  }
  param {
    name: "conv4_7/x1/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_7/x1_p1"
  type: "ReLU"
  bottom: "conv4_7/x1/bn_p1"
  top: "conv4_7/x1/bn_p1"
}
layer {
  name: "conv4_7/x1_p1"
  type: "Convolution"
  bottom: "conv4_7/x1/bn_p1"
  top: "conv4_7/x1_p1"
  param {
    name: "conv4_7/x1_w"
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
  }
}
layer {
  name: "conv4_7/x2/bn_p1"
  type: "BatchNorm"
  bottom: "conv4_7/x1_p1"
  top: "conv4_7/x2/bn_p1"
  param {
    name: "conv4_7/x2/bn_w1"
  }
  param {
    name: "conv4_7/x2/bn_w2"
  }
  param {
    name: "conv4_7/x2/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_7/x2/scale_p1"
  type: "Scale"
  bottom: "conv4_7/x2/bn_p1"
  top: "conv4_7/x2/bn_p1"
  param {
    name: "conv4_7/x2/scale_w"
  }
  param {
    name: "conv4_7/x2/scale_b"
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_7/x2_p1"
  type: "ReLU"
  bottom: "conv4_7/x2/bn_p1"
  top: "conv4_7/x2/bn_p1"
}
layer {
  name: "conv4_7/x2_p1"
  type: "Convolution"
  bottom: "conv4_7/x2/bn_p1"
  top: "conv4_7/x2_p1"
  param {
    name: "conv4_7/x2_w"
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat_4_7_p1"
  type: "Concat"
  bottom: "concat_4_6_p1"
  bottom: "conv4_7/x2_p1"
  top: "concat_4_7_p1"
}
layer {
  name: "conv4_8/x1/bn_p1"
  type: "BatchNorm"
  bottom: "concat_4_7_p1"
  top: "conv4_8/x1/bn_p1"
  param {
    name: "conv4_8/x1/bn_w1"
  }
  param {
    name: "conv4_8/x1/bn_w2"
  }
  param {
    name: "conv4_8/x1/bn_w3"
  }
  batch_norm_param {
    eps: 1e-05
  }
}
layer {
  name: "conv4_8/x1/scale_p1"
  type: "Scale"
  bottom: "conv4_8/x1/bn_p1"
  top: "conv4_8/x1/bn_p1"
  param {
    name: "conv4_8/x1/scale_w"
  }
  param {
    name: "conv4_8/x1/scale_b"
  }
